laravel/app/Http/Controllers/HomeController.php

select `tasks`.`id`, `tasks`.`start_time`, `tasks`.`finish_time`, `categories`.`name` from `tasks` left join `categories` on `tasks`.`category_id` = `categories`.`id` where `tasks`.`user_id` = 1
---
    public function home(){
        $user_id = Auth::id();
        // $tasks = Task::where('user_id',$user_id) -> get();
        $categories = Category::where('user_id',$user_id) -> get();

        $tasks = \DB::table('tasks')
            ->select('tasks.id','tasks.start_time','tasks.finish_time','categories.name')
            ->where('tasks.user_id',$user_id)
            ->leftJoin('categories','tasks.category_id','=','categories.id')
            ->get();