laravel/app/Http/Controllers/HomeGraphController.php

    public function send2Home1day(){
        $user_id = Auth::id();
        $tasks = \DB::table('tasks')
            ->select('tasks.id','tasks.start_time','tasks.finish_time','categories.name')
            ->where('tasks.user_id',$user_id)
            ->leftJoin('categories', 'tasks.category_id', '=', 'categories.id')
            ->get();
---
select `tasks`.`id`, `tasks`.`start_time`, `tasks`.`finish_time`, `categories`.`name` from `tasks` left join `categories` on `tasks`.`category_id` = `categories`.`id` where `tasks`.`user_id` = 1 and date(`tasks`.`start_time`) = '2021-06-26'