laravel/app/Http/Controllers/MeasurementController.php

select `time_records`.`id`, `time_records`.`start_time`, `time_records`.`finish_time`, `categories`.`name` from `time_records` left join `categories` on `time_records`.`category_id` = `categories`.`id` where `time_records`.`user_id` = 1 order by `time_records`.`id` desc limit 1
---
    public function measurement(){

        $user_id = Auth::id();
        $categories = Category::where('user_id',$user_id) -> get();

        $record = \DB::table('time_records')
            ->select('time_records.id','time_records.start_time','time_records.finish_time','categories.name')
            ->where('time_records.user_id',$user_id)
            ->orderBy('time_records.id','desc')
            ->leftJoin('categories','time_records.category_id','=','categories.id')
            ->first();

select `id` from `categories` where `name` = 'Programming' limit 1
select `time_records`.`id`, `time_records`.`start_time`, `categories`.`name` from `time_records` left join `categories` on `time_records`.`category_id` = `categories`.`id` where `time_records`.`user_id` = 1 order by `time_records`.`id` desc limit 1
---
    public function measurement_send(Request $request){
        $user_id = Auth::id();
        $category_id = Category::where('name',$request->category_choice)->value('id');

        $time_record = new TimeRecord;
        $time_record->user_id = $user_id;
        $time_record->state = 'Active';
        $time_record->start_time = Carbon::now();
        $time_record->category_id = $category_id;
        $time_record->save();


        $record = \DB::table('time_records')
            ->select('time_records.id','time_records.start_time','categories.name')
            ->where('time_records.user_id',$user_id)
            ->orderBy('time_records.id','desc')
            ->leftJoin('categories','time_records.category_id','=','categories.id')
            ->first();

update `time_records` set `finish_time` = '2021-06-26 15:19:29' where `user_id` = 1 and `id` = '16'
---
    public function measure_record(Request $request){
        $user_id = Auth::id();


        $time_record = TimeRecord::where('user_id',$user_id)
        ->where('id',$request->input('record_id'))
        ->update([
            'finish_time' => Carbon::now(),
            ]);

select `time_records`.`id`, `time_records`.`start_time`, `time_records`.`finish_time`, `categories`.`name` from `time_records` left join `categories` on `time_records`.`category_id` = `categories`.`id` where `time_records`.`user_id` = 1 order by `time_records`.`id` desc limit 1
---
    public function measurement2(){

        $user_id = Auth::id();

        $record = \DB::table('time_records')
        ->select('time_records.id','time_records.start_time','time_records.finish_time','categories.name')
        ->where('time_records.user_id',$user_id)
        ->orderBy('time_records.id','desc')
        ->leftJoin('categories','time_records.category_id','=','categories.id')
        ->first();

select `id` from `categories` where `name` = 'Programming' limit 1
update `time_records` set `start_time` = '2021-06-26T02:00:04', `finish_time` = '2021-06-26T15:00:39', `category_id` = 1 where `user_id` = 1 and `id` = '15'
---
    public function measure_record3(Request $request){
        $user_id = Auth::id();
        $category_id = Category::where('name',$request->input('category'))->value('id');

        $time_record = TimeRecord::where('user_id',$user_id)
            ->where('id',$request->input('record_id'))
            ->update([
                'start_time' => $request->input('start_time'),
                'finish_time' => $request->input('finish_time'),
                'category_id' => $category_id
            ]);