laravel/app/Http/Controllers/TimeRecordController.php

select `tr`.`id`, `tr`.`start_time`, `tr`.`finish_time`, `categories`.`name` as `name` from `time_records` as `tr` left join `categories` on `tr`.`category_id` = `categories`.`id` where `tr`.`user_id` = 1 and date(`tr`.`start_time`) = '2021-06-26'
---
    public function send2Gantt(){
        $user_id = Auth::id();
        $today = date("Y-m-d");
        $time_records = \DB::table('time_records as tr')
            ->select('tr.id', 'tr.start_time', 'tr.finish_time', 'categories.name as name')
            ->where('tr.user_id', $user_id)
            ->whereDate('tr.start_time',$today)
            ->leftJoin('categories', 'tr.category_id', '=', 'categories.id')
            ->get();

select `tr`.`id`, `tr`.`start_time`, `tr`.`finish_time`, `categories`.`name` as `name` from `time_records` as `tr` left join `categories` on `tr`.`category_id` = `categories`.`id` where `tr`.`user_id` = 1 and `tr`.`id` = '15'
---
    public function record_edit($id){

        $user_id = Auth::id();
        $time_records = \DB::table('time_records as tr')
            ->select('tr.id', 'tr.start_time', 'tr.finish_time', 'categories.name as name')
            ->where('tr.user_id', $user_id)
            ->where('tr.id',$id)
            ->leftJoin('categories', 'tr.category_id', '=', 'categories.id')
            ->get();